const defaultOptions = [
  { label: "Зовсім не згоден", value: 1 },
  { label: "2", value: 2 },
  { label: "3", value: 3 },
  { label: "4", value: 4 },
  { label: "5", value: 5 },
  { label: "6", value: 6 },
  { label: "Повністю згоден", value: 7 },
];

export default {
    id: "aaq-ii",
    title: "Тест на психологічну гнучкість",
    description:
        "Цей тест допомагає визначити, наскільки ти здатен залишатися стійким і діяти згідно зі своїми цінностями навіть у складних чи емоційно болючих ситуаціях. Показує рівень внутрішньої гнучкості та самоприйняття.",
    time: "2-3 хв",
    category: "усвідомленість",
    questions: [
        { text: "Я боюся своїх емоцій.", options: defaultOptions },
        { text: "Я часто уникаю негативних думок і почуттів.", options: defaultOptions },
        { text: "Емоційний біль заважає мені жити повним життям.", options: defaultOptions },
        { text: "Моє життя було б кращим, якби я не переживав негативні емоції.", options: defaultOptions },
        { text: "Я намагаюся контролювати все, що відчуваю всередині.", options: defaultOptions },
        { text: "Негативні емоції обмежують моє функціонування.", options: defaultOptions },
        { text: "Я витрачаю багато енергії, щоби уникати болючих емоцій.", options: defaultOptions },
    ],
    interpret: (answers) => {
        const score = answers.reduce((a, b) => a + (parseInt(b) || 0), 0);

        let description = "";
        if (score <= 17) {
            description =
                "Високий рівень психологічної гнучкості. Ви здатні зберігати стійкість навіть у складних емоційних ситуаціях.";
        } else if (score <= 24) {
            description =
                "Середній рівень психологічної гнучкості. Ви іноді уникаєте емоцій, але все ще можете залишатись відкритим до себе.";
        } else {
            description =
                "Низький рівень психологічної гнучкості. Вам може бути важко приймати неприємні почуття, і це може впливати на якість життя.";
        }

        return {
            scales: {
                Flexibility: {
                    title: "Психологічна гнучкість",
                    score,
                    description,
                },
            },
            note: `Шкала інтерпретації:
0–17 = високий рівень психологічної гнучкості
18–24 = середній рівень
25–49 = низький рівень`,
        };
    },
};

