const defaultOptions = [
  { label: "Ніколи", value: 0 },
  { label: "Рідко", value: 1 },
  { label: "Іноді", value: 2 },
  { label: "Часто", value: 3 },
  { label: "Завжди", value: 4 },
];

const reversedOptions = [...defaultOptions].reverse();

export default {
    id: "stress-scale",
    title: "Тест на сприйняття стресу",
    description:
        "Методика Шелдона Коена (Perceived Stress Scale). Допомагає оцінити, як ти сприймаєш напруження у повсякденному житті протягом останніх тижнів. Тест показує, наскільки твій організм і психіка потребують відновлення чи відпочинку.",
  time: "3–5 хв",
  category: "стрес",
  questions: [
    { text: "Наскільки часто ти почувався не в змозі контролювати важливі речі у своєму житті?", options: defaultOptions },
    { text: "Наскільки часто ти відчував впевненість у здатності впоратись із особистими проблемами?", options: reversedOptions },
    { text: "Наскільки часто ти почував, що не можеш контролювати труднощі, які накопичились?", options: defaultOptions },
    { text: "Наскільки часто ти почував, що добре справляєшся з важливими питаннями у своєму житті?", options: reversedOptions },
    { text: "Наскільки часто ти почував, що все йде не так, як ти хочеш?", options: defaultOptions },
    { text: "Наскільки часто ти зміг контролювати роздратування у своєму житті?", options: reversedOptions },
    { text: "Наскільки часто ти почував, що перебуваєш під сильним тиском?", options: defaultOptions },
    { text: "Наскільки часто ти вважав, що справляєшся з повсякденними завданнями?", options: reversedOptions },
    { text: "Наскільки часто ти почував, що негативні події накопичуються одна за одною?", options: defaultOptions },
    { text: "Наскільки часто ти почував, що встигав упоратись з усім, що тобі потрібно?", options: reversedOptions },
  ],
    interpret: (answers) => {
        const score = answers.reduce((a, b) => a + (b || 0), 0);

        let level = "";
        if (score <= 13) level = "Низький рівень стресу";
        else if (score <= 20) level = "Помірний рівень стресу";
        else level = "Високий рівень стресу";

        return {
            scales: {
                Stress: {
                    title: "Загальний рівень стресу",
                    score: Number(score), // 👈 щоб точно було число
                    description: level,
                },
            },
            note: `Шкала інтерпретації (PSS-10):
0–13 = низький рівень стресу
14–20 = помірний рівень стресу
21–40 = високий рівень стресу

Результат відображає, як ви суб'єктивно сприймаєте стрес у своєму житті протягом останніх тижнів.`,
        };
    },


};
