// src/components/Journal/moodTags.js

export const moodTags = {
  negative: {
    moods: ["Дуже погано", "Погано", "Скоріше Погано"],
    tags: [
      "Злість",
      "Тривожність",
      "Страх",
      "Перевантаження",
      "Сором",
      "Огида",
      "Збентеження",
      "Фрустрація",
      "Невдоволення",
      "Заздрість",
      "Стрес",
      "Стурбованість",
      "Провина",
      "Здивування",
      "Зневіра",
      "Роздратованість",
      "Самотність",
      "Знеохочення",
      "Розчарування",
      "Виснаженість",
      "Сум"
    ]
  },
  neutral: {
    moods: ["Нейтрально"],
    tags: [
      "Приємність",
      "Спокій",
      "Умиротвореність",
      "Байдужість",
      "Виснаженість"
    ]
  },
  positive: {
    moods: ["Скоріше добре", "Добре", "Дуже добре"],
    tags: [
      "Приємний подив",
      "Здивування",
      "Радість",
      "Упевненість",
      "Задоволення",
      "Приємність",
      "Піднесення",
      "Захопленість",
      "Сміливість",
      "Гордість",
      "Надія",
      "Утіха",
      "Полегшення",
      "Спокій",
      "Щастя",
      "Вдячність",
      "Умиротвореність"
    ]
  }
};
